#language: ru

@tree
@exportscenarios

Функционал: Подготовка справочника Товары

Как тестировщих я хочу
подготовить начальные данны для тестирования справочника Товары
чтобы сделать тесты устойчивыми

Сценарий: Я подготавливаю справочник Товары
	
	// Справочник.Валюты

	И я проверяю или создаю для справочника "Валюты" объекты:
		| 'Ссылка'                                                            | 'ПометкаУдаления' | 'Код'       | 'Наименование' | 'НаименованиеОсновнойВалюты' | 'НаименованиеРазменнойВалюты' |
		| 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'False'           | '000000001' | 'Рубли'        | 'рубль'                      | 'копейка'                     |

	// Справочник.ВидыЦен

	И я проверяю или создаю для справочника "ВидыЦен" объекты:
		| 'Ссылка'                                                             | 'ПометкаУдаления' | 'Код'       | 'Наименование' |
		| 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 'False'           | '000000003' | 'Мелкооптовая' |

	// Справочник.Контрагенты

	И я проверяю или создаю для справочника "Контрагенты" объекты:
		| 'Ссылка'                                                                 | 'ПометкаУдаления' | 'Родитель'                                                               | 'ЭтоГруппа' | 'Код'       | 'Наименование'            | 'Регион'                                                             | 'Индекс' | 'Страна' | 'Город'  | 'Улица'        | 'Дом' | 'Телефон'          | 'ЭлектроннаяПочта'    | 'Факс'             | 'ВебСайт' | 'ВидЦен'                                                             | 'ДополнительнаяИнформация' | 'КонтактноеЛицо' | 'Широта' | 'Долгота' |
		| 'e1cib/data/Справочник.Контрагенты?ref=8ca1000d8843cd1b11dc8ea92d97a74a' | 'False'           | 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8c4c9d5c422d' | 'False'     | '000000016' | 'Покупатель мелкооптовый' | 'e1cib/data/Справочник.Регионы?ref=a9b000055d49b45e11db8c4c9d5c422f' | '235489' | 'Россия' | 'Москва' | 'Селезневская' | '10'  | '+7(999)256-99-33' | 'korovin@myasnoya.ru' | '+7(999)256-99-32' | ''        | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | ''                         | 'Коровин С. П.'  | 55.78081 | 37.608828 |
		| 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8c4c9d5c422d' | 'False'           | ''                                                                       | 'True'      | '000000002' | 'Покупатели'              | ''                                                                   | ''       | ''       | ''       | ''             | ''    | ''                 | ''                    | ''                 | ''        | ''                                                                   | ''                         | ''               | ''       | ''        |

	// Справочник.Организации

	И я проверяю или создаю для справочника "Организации" объекты:
		| 'Ссылка'                                                                 | 'ПометкаУдаления' | 'Код'       | 'Наименование'       | 'ВалютныйУчет' |
		| 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c63' | 'False'           | '000000001' | 'ООО "Все для дома"' | 'True'         |

	// Справочник.Регионы

	И я проверяю или создаю для справочника "Регионы" объекты:
		| 'Ссылка'                                                             | 'ПометкаУдаления' | 'Код'       | 'Наименование' |
		| 'e1cib/data/Справочник.Регионы?ref=a9b000055d49b45e11db8c4c9d5c422f' | 'False'           | '000000001' | 'Москва'       |

	// Справочник.Склады

	И я проверяю или создаю для справочника "Склады" объекты:
		| 'Ссылка'                                                            | 'ПометкаУдаления' | 'Код'       | 'Наименование' | 'НеИспользовать' |
		| 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bee7616e1' | 'False'           | '000000002' | 'Большой'      | 'False'          |

	// Справочник.Товары

	И я проверяю или создаю для справочника "Товары" объекты:
		| 'Ссылка'                                                            | 'ПометкаУдаления' | 'Родитель'                                                          | 'ЭтоГруппа' | 'Код'       | 'Наименование'       | 'Артикул' | 'Поставщик' | 'ФайлКартинки' | 'Вид'                     | 'Штрихкод' | 'Описание' |
		| 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291f' | 'False'           | 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291d' | 'False'     | '000000034' | 'Услуга с картинкой' | ''        | ''          | ''             | 'Enum.ВидыТоваров.Услуга' | ''         | ''         |
		| 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291e' | 'False'           | 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291c' | 'False'     | '000000033' | 'Товар с картинкой'  | '111'     | ''          | ''             | 'Enum.ВидыТоваров.Товар'  | ''         | ''         |
		| 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291d' | 'False'           | ''                                                                  | 'True'      | '000000032' | 'Услуги'             | ''        | ''          | ''             | ''                        | ''         | ''         |
		| 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291c' | 'False'           | ''                                                                  | 'True'      | '000000031' | 'Товары'             | ''        | ''          | ''             | ''                        | ''         | ''         |

	И я проверяю или создаю для регистра сведений "ЦеныТоваров" записи:
		| 'Период'             | 'Товар'                                                             | 'ВидЦен'                                                             | 'Цена' |
		| '01.02.2022 0:00:00' | 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291e' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 500    |
		| '01.02.2022 0:00:00' | 'e1cib/data/Справочник.Товары?ref=898200198600304911ec93369e08291f' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 200    |
